{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Master in Electrical \u0026 Computer Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "Aug 2019 - May 2021",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electronics \u0026 Communication",
      "duration": "Sep 2015 - May 2019",
      "school_name": "Gujarat Technological University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_demo",
  "highlighted_projects": [
    {
      "description": "MTU-Space is a python-based website build using Django framework. Website that manages the student system. The admin user will be able to add student database to the website. Users must have MTU_ID and Password to access the service and edit or update the database.",
      "git_url": "https://github.com/harshpatel77/MTUSpace.git",
      "name": "School Management System (MTU-Space)"
    },
    {
      "description": "Book World is a java-based website which allow the user to search and purchase books based on their category of choice. Website that manages the bookstore, update the database based on purchase.",
      "git_url": null,
      "name": "Book World (E-Bookstore)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Cluster Monitoring Agent on a remote CentOS machine. Executed a bash script to collect the hardware specifications of each node in a cluster and monitor resource usages every minute with the help of Crontab. The data is collected and stored in a PostgreSQL server that runs inside a docker container.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitor"
    },
    {
      "description": [
        "JDBC App:  The JDBC application allows data retrieval from a retail database for customers and orders using Java from RDBMS through JDBC. The application implements the CRUD (Create Read Update Delete) operations using Data Transfer Objects and Data Access Objects. The PostgreSQL instance was provisioned using the docker container, and the dependencies were managed through Maven.",
        "Grep App:  Implemented a JavaGrep interface to perform functions the same as the grep command in Linux. The program was written with the help of IntelliJ and searched patterns recursively in a given directory that stores the matched lines to an output file. Stream and lambda expressions were used for the efficient search through the directories and files. slf4j was used for logging messages. The Java grep app was packaged using Maven and dockerized to consume it easily.."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Harsh Patel",
  "others": [
    {
      "bullets": [
        "Fortinet Network Security Expert Level 1: Certified Associate",
        "Fortinet Network Security Expert Level 2: Certified Associate",
        "AWS Concept (Udemy)",
        "Software Engineering Virtual Experience (JPMorgan Chase \u0026 Co.)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Active member of Institute of Electrical and Electronics Engineering (IEEE) society in GCET, Anand",
        "Active member of Indian Society for Technical Education (ISTE) in GCET, Anand",
        "Cricket Player"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "National Bank of Canada",
      "description": "Collaborated in team based, Agile environment to accomplish objectives by deadlines. Worked with colleagues and senior developers to design and implements scalable solutions. Play a pivotal role as a part of an agile scrum team accountable, developing new application and working on AWS cloud using Terraform. Collaborated with team member to analyze potential system solution based on evolving client requirements. Created framework for testing the application for NBC project.",
      "duration": "Jan 2022 - Jun 2022",
      "title": "Software Developer"
    },
    {
      "company": "Jarvis",
      "description": "Developed, analyzed, and modified programming systems, including encoding, unit testing, and debugging. Worked with a diverse array of large data sets and large-scale data platforms. Followed agile methodologies and git-flow to develop java applications that run in Docker containers. Contributed to code-review sessions and ensured that code quality aligns with business and project requirements.",
      "duration": "Oct 2021 - Present",
      "title": "Software Developer"
    },
    {
      "company": "E-Vector Networking Inc",
      "description": " - Involved in the weekly status report update with the manager and in the weekly Bug's status meetings along with QA Team and development team across the border. - Perform system, unit, acceptance, regression, load and functional/performance testing using automated testing. - Created automation test scripts using selenium web-driver and JavaScript. - Used Selenium web-driver to run test scripts on different platforms and against different browsers in parallel. - Validate, verify, communicate and resolve software issues through careful, thoroughly documented testing. ",
      "duration": "Jun 2020 - Nov 2020",
      "title": "Software Quality Assurance Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "PSQL",
      "AWS Cloud Platform",
      "Jenkins",
      "Jira",
      "Confluence"
    ],
    "familiar": [
      "Hadoop",
      "Maven",
      "IntelliJ",
      "VS Code",
      "Jupiter Notebook",
      "Shopify"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Terraform"
    ]
  },
  "summary": "A passionate learner, detail-oriented, responsible, and committed engineer, graduated with a Masters in Computer Engineering degree from Concordia University. Having experience and understanding of agile scrum methodology, willing to work beyond the comfort zone to achieve milestones. In addition, with the knowledge of RDBMS, SQL, Data modelling, and Java. I have developed various applications following Software Development Life Cycle (SDLC) and enhanced analytical, strategic planning, and communication skills as a Software Engineer at Jarvis. With a keen interest in transforming business needs into requirements, I aim to apply the skills in a dynamic business environment to find innovative solutions for complex problems."
}
